{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science in Computer Science",
      "department": "Lassonde School of Engineering",
      "duration": "Sept 2018 - Feb 2023",
      "school_name": "York university"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AlanLee",
  "highlighted_projects": [
    {
      "description": "Engineered a full-stack web application leveraging Node.js for robust backend services and Angular for a dynamic frontend, supported by SQLite for database management, where I designed and deployed a comprehensive backend architecture to craft RESTful APIs for efficient management of product catalogs, shopping cart functionalities, and checkout procedures, while also enhancing user experience by developing intuitive shopping cart features and a seamless checkout flow for a responsive and interactive web interface.",
      "git_url": null,
      "name": "Shopping Cart"
    },
    {
      "description": "Developed a Python-based application to gather and analyze sentiment from similar apps on the Google Play Store, delivering valuable insights into user feedback, and utilized the Natural Language Toolkit (NLTK) library for preprocessing each review, which enabled accurate sentiment analysis and facilitated the creation of a list of topics for each app.",
      "git_url": null,
      "name": "Sentiment Analyzer"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an MVP to enhance Linux cluster management, focusing on real-time CPU usage monitoring. This was achieved by deploying Bash scripts, scheduled via crontab to run every minute, to collect hardware specifications and CPU usage data. The information was stored in a PostgreSQL database, established using Docker, enabling improved resource allocation and system performance. This setup ensures continuous and automated tracking of CPU performance across nodes.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Alan Lee",
  "others": [
    {
      "bullets": [
        "Reading"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Utilized Docker to containerize applications, integrating PostgreSQL for efficient database management. Developed Bash scripts and employed Linux commands to optimize development workflows. Engaged in daily scrum meetings, facilitating agile project progression and continuous adaptation to new technologies.",
      "duration": "Jan 2024 - present",
      "title": "Software Developer"
    },
    {
      "company": "inspoboard",
      "description": "Developed a JavaScript-based Chrome extension designed for marketing professionals, enhancing our web platform by streamlining ad imports from Facebook and TikTok, resulting in a 94% boost in ad management efficiency; architected a collaborative feature introducing shared workspaces that significantly improved teamwork productivity and user engagement; engineered a integration with Stripe's API for secure payment transactions, incorporating custom logic for prorated credit calculations for usage-based plan changes;  collaborated within a three-person team, focusing on backend development while also taking on significant frontend tasks using React, within a scrum framework to ensure efficient project progression and daily task management.",
      "duration": "Dec 2022 - Jan 2024",
      "title": "Full Stack Developer"
    }
  ],
  "skills": {
    "competent": [
      "AWS",
      "Stripe",
      "Docker",
      "Jest/Unit Testing",
      "Cloud Services (AWS)",
      "Puppeteer"
    ],
    "familiar": [
      "Python",
      "Angular",
      "C",
      "Springboot",
      "GraphQL"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "JavaScript",
      "MonogoDb/NoSQL",
      "React",
      "Node.js",
      "Git",
      "Typescript"
    ]
  },
  "summary": "I'm currently embracing the role of a software developer at Jarvis, where I continue to expand my technical skills and innovate within the tech industry. Prior to joining Jarvis, I served as a full-stack developer at a marketing analytics platform, where I gained substantial experience in building applications using the MERN stack (MongoDB, Express, React, and Node.js). My academic journey in computer science at York University provided me with a strong foundation in software development, equipping me with the knowledge and skills to excel in my professional career.\nWhat truly excites me about the software industry is its constant evolution and the capacity to drive significant improvements in quality of life through technology. I am deeply passionate about leveraging my skills to develop software solutions that are not only innovative but also accessible and impactful. The opportunity to tackle complex problems, contribute to meaningful projects, and continuously learn in this ever-changing field is what motivates me daily. My experiences, both academic and professional, have fueled my enthusiasm for making a positive difference through technology, and I look forward to contributing to transformative projects in my current and future roles."
}
